{"email_id": 1, "sender": "alice@example.com", "subject": "Project update", "body": "Hi team, just a quick reminder to finalize your sections of the quarterly report by Monday. Once everyone submits, I’ll compile the full version and share it for review. Please also double-check the analytics dashboard to make sure all charts are updated with this week’s data. Let me know if you run into any blockers."}
{"email_id": 2, "sender": "bob@example.com", "subject": "Meeting reschedule", "body": "The client meeting originally planned for Tuesday has been rescheduled to Wednesday at 3 PM. Please update your calendars accordingly. We’ll use the same Zoom link as before. If anyone has a conflict, let me know so I can coordinate with the client for an alternative slot."}
{"email_id": 3, "sender": "carol@example.com", "subject": "Invoice pending", "body": "This is a friendly reminder that invoice #1023 for last month’s design work remains unpaid. Please arrange for payment by Friday to avoid late fees. If there are any issues with the invoice or you need additional documentation, don’t hesitate to reach out. Thank you for your prompt attention."}
{"email_id": 4, "sender": "david@example.com", "subject": "Follow-up on proposal", "body": "I wanted to check in regarding the proposal I shared earlier this week. Please review the document when you get a chance and share your comments by Friday afternoon. We’ll need to finalize it for submission to the client by the end of the week. I’m happy to jump on a short call if any sections need clarification."}
{"email_id": 5, "sender": "emma@example.com", "subject": "Team offsite preparation", "body": "We’re moving ahead with plans for the team offsite next month. Please fill out the travel survey by Wednesday so we can finalize accommodation and transport. Also, submit any dietary preferences or restrictions. I’ll share the tentative agenda once we confirm the venue."}
{"email_id": 6, "sender": "frank@example.com", "subject": "Website content updates", "body": "We’re planning a minor refresh of the homepage next week. Please review your respective content sections and suggest updates by Tuesday morning. Marketing will handle visuals once copy is finalized. Let’s keep the tone consistent across all pages."}
{"email_id": 7, "sender": "grace@example.com", "subject": "Security policy changes", "body": "IT has rolled out new password requirements effective immediately. All employees need to update their passwords to meet the new criteria by end of this week. Please log into the portal and complete the change to avoid account lockouts. Reach out to IT support if you face issues."}
{"email_id": 8, "sender": "henry@example.com", "subject": "Monthly budget report", "body": "Finance is preparing the monthly expense report. Department heads are requested to review their spending breakdowns and submit justifications for any discrepancies by Thursday. Once approved, we’ll circulate the final version to management. Thanks for your cooperation."}
{"email_id": 9, "sender": "irene@example.com", "subject": "New intern onboarding", "body": "We’ll be welcoming three new interns starting next Monday. Please make sure your teams have assigned mentors and access permissions set up in advance. HR will send calendar invites for the introductory session. Let’s ensure a smooth onboarding experience."}
{"email_id": 10, "sender": "jack@example.com", "subject": "Product feedback session", "body": "We’ve received user feedback on the latest app release, and a few performance issues were highlighted. Let’s discuss these in our product sync on Friday and decide which fixes to prioritize. Please review the feedback summary doc in the shared drive before the meeting. Thanks for your input as always."}
